snlkuharlocal/src/Documents/РасчетЗаказаПоставщику/РасчетЗаказаПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасчетЗаказаПоставщику</name>
  <attributes>
    <name>ДатаПредварительногоЗаполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончательногоЗаполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаПроизводство</name>
    <type>
      <types>DocumentRef.ЗаявкаНаПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРасчетаЗаказа</name>
    <type>
      <types>EnumRef.ВидыРасчетаЗаказаНаПроизводство</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комплектующие</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПродукции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПрофицитКомплектующих</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЗаВычетомСпаек</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПроцентСпаекСобираемыхНаСкладе</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентУменьшенияПланов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПродукцияСНедостачейКомплектующих</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Enums/ВидыРасчетаЗаказаНаПроизводство/ВидыРасчетаЗаказаНаПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыРасчетаЗаказаНаПроизводство</name>
  <enumValues>
    <name>РасчетПлановКомплектующихПоСпайкам</name>
  </enumValues>
  <enumValues>
    <name>РасчетУменьшенияПлановСпаекПоПрофицитуКомплектующих</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/РасчетЗаказаПоставщику/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	 УправлениеВидимостью();
КонецПроцедуры



&НаКлиенте
Процедура УправлениеВидимостью()
	если не объект.ВидРасчетаЗаказа = Перечисления.ВидыРасчетаЗаказаНаПроизводство.РасчетПлановКомплектующихПоСпайкам тогда
		Элементы.ГруппаТовары.Видимость = ложь;
		элементы.ГруппаКомплектующие.Видимость = ложь;
	Иначе 
		Элементы.ГруппаТовары.Видимость = Истина;
		элементы.ГруппаКомплектующие.Видимость = Истина;
	КонецЕсли;    
	
	
	
	если не объект.ВидРасчетаЗаказа = Перечисления.ВидыРасчетаЗаказаНаПроизводство.РасчетУменьшенияПлановСпаекПоПрофицитуКомплектующих тогда
		Элементы.ГруппаПрофицитКомплектующих.Видимость = ложь;
		элементы.ГруппаПроцентСпаекСобираемыхНаСкладе.Видимость = ложь;          
		// Кухарь А.Ю. 05.12.2025 начало
		// OUT-171
		элементы.ГруппаПродукцияСНедостачейКомплектующих.Видимость = ложь;  
		// Кухарь А.Ю. 05.12.2025 конец
		
	Иначе 
		Элементы.ГруппаПрофицитКомплектующих.Видимость = Истина;
		элементы.ГруппаПроцентСпаекСобираемыхНаСкладе.Видимость = Истина;  
		// Кухарь А.Ю. 05.12.2025 начало
		// OUT-171
		элементы.ГруппаПродукцияСНедостачейКомплектующих.Видимость = Истина;  
		// Кухарь А.Ю. 05.12.2025 конец
		
	КонецЕсли;    	
	
КонецПроцедуры
